app/controllers/message_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."deleted" = ?  [["deleted", 0]]
SELECT "messages".* FROM "messages"
---
  def home
      @messages = Message.where(deleted: 0)
      @history_messages = Message.all

INSERT INTO "messages" ("message", "deleted", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["message", "Take a bath"], ["deleted", 0], ["created_at", "2023-06-22 03:44:01.805036"], ["updated_at", "2023-06-22 03:44:01.805036"]]
---
  def create
    new_message = params[:message]
    puts new_message


    @message = Message.create(message: new_message, deleted: 0)

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "messages" SET "deleted" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["deleted", 1], ["updated_at", "2023-06-22 05:56:59.694716"], ["id", 14]]
---
   def destroy
    @message = Message.find(params[:id])
    puts @message

    if @message.update(deleted: 1)